//=============================================================================
//
// 動物UI処理 [animal.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "animalui.h"
#include "polygon.h"

//=============================================================================
//アニマルUIクラスのコンストラクタ
//=============================================================================
CAnimalUi::CAnimalUi(int nPriority):CScene(nPriority)
{
	//メンバ変数のクリア
	m_Polygon = NULL;
}

//=============================================================================
//アニマルUIクラスのデストラクタ
//=============================================================================
CAnimalUi::~CAnimalUi()
{
}

//=============================================================================
//アニマルUIクラスのクリエイト処理
//=============================================================================
CAnimalUi * CAnimalUi::Create(void)
{
	//アニマルUIクラスのポインタ変数
	CAnimalUi *pAnimalUI = NULL;

	//メモリの確保
	pAnimalUI = new CAnimalUi;

	//メモリが確保できていたら
	if (pAnimalUI)
	{
		//初期化処理呼び出し
		pAnimalUI->Init();
	}
	else
	{
		return NULL;
	}

	return pAnimalUI;
}

//=============================================================================
//アニマルUIクラスの初期化処理
//=============================================================================
HRESULT CAnimalUi::Init(void)
{
	//ポリゴンクラスの生成
	m_Polygon = CPolygon::Create(D3DXVECTOR3(800.0f, 0.0f + (90.0f /2), 0.0f), D3DXVECTOR3(100.0f, 100.0f, 0.0f), CPolygon::TEX_TYPE_CHEETAH);

	return S_OK;
}

//=============================================================================
//アニマルUIクラスの終了処理
//=============================================================================
void CAnimalUi::Uninit(void)
{
	if (m_Polygon)
	{
		//ポリゴンクラスの終了処理呼び出し
		m_Polygon->Uninit();

		//メモリの破棄
		delete m_Polygon;

		//メモリのクリア
		m_Polygon = NULL;
	}

	//オブジェクトの破棄
	SetDeathFlag();
}

//=============================================================================
//アニマルUIクラスの更新処理
//=============================================================================
void CAnimalUi::Update(void)
{
	if (m_Polygon)
	{
		//ポリゴンクラスの更新処理呼び出し
		m_Polygon->Update();
	}
}

//=============================================================================
//アニマルUIクラスの描画処理
//=============================================================================
void CAnimalUi::Draw(void)
{
	if (m_Polygon)
	{
		//ポリゴンクラスの描画処理呼び出し
		m_Polygon->Draw();
	}
}

//=============================================================================
//アニマルUIクラスの情報取得処理
//=============================================================================
CPolygon * CAnimalUi::GetPolygon(void) const
{
	return m_Polygon;
}
