//=============================================================================
//
// メイン処理 [main.h]
// Author : 
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include <windows.h>
#define DIRECTINPUT_VERSION (0x0800)	//警告対処用（"dinput.h"の直前に定義）
#include <dinput.h>
#include "d3dx9.h"
#include "XAudio2.h"


//=============================================================================
// ライブラリファイルのリンク
//=============================================================================
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")
#pragma comment(lib, "dxguid.lib")
#pragma comment(lib,"winmm.lib")
#pragma comment(lib,"dinput8.lib")	//入力処理に必要

//=============================================================================
// マクロ定義
//=============================================================================
#define	WINDOW_POS_X	(0)
#define	WINDOW_POS_Y	(0)
#define SCREEN_WIDTH	(1280)	//ウィンドウの横幅
#define SCREEN_HEIGHT	(720)	//ウィンドウの縦幅
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)
#define NUM_VERTEX (4)	//頂点数
#define NUM_POLYGON (2)	//ポリゴン数
//#undef _DEBUG	//_DEBUGフラグを無効化する
//#define _RSTICK_	//コメントアウト：右スティック移動の無効化

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//頂点座標
	float rhw;	//座標変換用係数（1.0fで固定）
	D3DCOLOR col;	//頂点カラー
	D3DXVECTOR2 tex;	//テクスチャ座標
}VERTEX_2D;

#ifdef _DEBUG
//=============================================================================
//プロトタイプ関数宣言
//=============================================================================
int GetFPS(void);
#endif

#endif