//=============================================================================
//
// メイン処理 [lifeber.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _LIFEBER_H_
#define _LIFEBER_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "gauge.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define LIFE_GAGUE_SIZE_X 450.0f	//ライフゲージのX軸のサイズ
#define LIFE_GAGUE_SIZE_Y 18	//ライフゲージのY軸のサイズ
#define LIFE_GAGUE_SIZE D3DXVECTOR3(LIFE_GAGUE_SIZE_X,LIFE_GAGUE_SIZE_Y,0.0f)	//ライフゲージのサイズ

//=============================================================================
//ライフバークラス
//=============================================================================
class CLifeber :public CGauge
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CLifeber(int nPriority = CScene::PRIORITY_UI);
	~CLifeber();

	static CLifeber *Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size, const D3DXCOLOR col,
		const int nGaugeNum, const int nMaxGaugeNum);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	
private:
};
#endif