//=============================================================================
//
// スキル処理 [skillber.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "skillber.h"

//=============================================================================
//マクロ定義
//=============================================================================


//=============================================================================
//スキルクラスのコンストラクタ
//=============================================================================
CSkillber::CSkillber(int nPriority) : CGauge(nPriority)
{
}

//=============================================================================
//スキルクラスのデストラクタ
//=============================================================================
CSkillber::~CSkillber()
{
}

//=============================================================================
//スキルクラスのクリエイト処理
//=============================================================================
CSkillber * CSkillber::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size, const D3DXCOLOR col,
	const int nGaugeNum, const int nMaxGaugeNum)
{
	//スキルクラスのポインタ変数
	CSkillber *pSkill = NULL;

	//メモリの確保
	pSkill = new CSkillber;

	//メモリが確保できていたら
	if (pSkill)
	{
		pSkill->SetPos(pos);
		pSkill->SetSize(size);
		pSkill->SetColor(col);
		pSkill->SetMaxGauge(nMaxGaugeNum);
		pSkill->SetGauge(nGaugeNum);
		//初期化処理呼び出し
		pSkill->Init();
	}
	//メモリ確保に失敗したとき
	else
	{
		return NULL;
	}

	return pSkill;
}

//=============================================================================
//スキルクラスの初期化処理
//=============================================================================
HRESULT CSkillber::Init(void)
{
	//ゲージクラスの初期化処理
	CGauge::Init();

	return S_OK;
}

//=============================================================================
//スキルクラスの終了処理
//=============================================================================
void CSkillber::Uninit(void)
{
	//ゲージクラスの終了処理
	CGauge::Uninit();
}

//=============================================================================
//スキルクラスの更新処理
//=============================================================================
void CSkillber::Update(void)
{
	//ゲージクラスの更新処理
	CGauge::Update();
}

//=============================================================================
//スキルクラスの描画処理
//=============================================================================
void CSkillber::Draw(void)
{
	//ゲージクラスの描画処理
	CGauge::Draw();
}