//=============================================================================
//
// スキル処理 [skillber.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _SKILL_H_
#define _SKILL_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "gauge.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SKILL_GAGUE_SIZE_X 433.0f	//スキルゲージのX軸のサイズ
#define SKILL_GAGUE_SIZE_Y 19	//スキルゲージのY軸のサイズ
#define SKILL_GAGUE_SIZE D3DXVECTOR3(SKILL_GAGUE_SIZE_X,SKILL_GAGUE_SIZE_Y,0.0f)	//スキルゲージのサイズ

//=============================================================================
//スキルクラス
//=============================================================================
class CSkillber : public CGauge
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CSkillber(int nPriority = CScene::PRIORITY_UI);
	~CSkillber();

	static CSkillber *Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size, const D3DXCOLOR col,
		const int nGaugeNum, const int nMaxGaugeNum);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};

#endif 