//=============================================================================
//
// フェード処理 [fade.h]
// Author : 山田陵太
//
//=============================================================================
#include "fade.h"
#include "manager.h"
#include "renderer.h"
#include "polygon.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define FADE_RATE (0.02f)	//α値変動係数

//=============================================================================
//フェードクラスのコンストラクタ
//=============================================================================
CFade::CFade()
{
	m_pPolygon = NULL;
	m_FadeMode = FADE_MODE_NONE;
	m_colorFade = D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f);
	m_modeNext = CManager::MODE_TYPE_TITLE;
}

//=============================================================================
//フェードクラスのデストラクタ
//=============================================================================
CFade::~CFade()
{
}

//=============================================================================
//フェードクラスのクリエイト処理
//=============================================================================
CFade * CFade::Create(void)
{
	//フェードクラスのポインタ変数
	CFade *pFade = NULL;

	//メモリを確保
	pFade = new CFade;

	//メモリが確保できていたら
	if (pFade)
	{
		//初期化処理呼び出し
		pFade->Init();
	}
	//メモリ確保に失敗したとき
	else
	{
		return NULL;
	}

	return pFade;
}

//=============================================================================
//フェードクラスの初期化処理
//=============================================================================
HRESULT CFade::Init(void)
{
	m_FadeMode = FADE_MODE_OUT;

	//ポリゴンクラスを生成
	m_pPolygon = CPolygon::Create(SCREEN_CNTER_POS, SCREEN_SIZE, CPolygon::TEX_TYPE_NORE);
	
	//色を設定
	m_pPolygon->SetColor(m_colorFade);

	return S_OK;
}

//=============================================================================
//フェードクラスの終了処理
//=============================================================================
void CFade::Uninit(void)
{
	if (m_pPolygon)
	{
		//ポリゴンクラスの終了処理呼び出し
		m_pPolygon->Uninit();

		//メモリの破棄
		delete m_pPolygon;

		//メモリのクリア
		m_pPolygon = NULL;
	}
}

//=============================================================================
//フェードクラスの更新処理
//=============================================================================
void CFade::Update(void)
{
	if (m_pPolygon)
	{
		if (m_FadeMode != FADE_MODE_NONE)
		{
			//フェードイン(明転)処理
			if (m_FadeMode == FADE_MODE_IN)
			{
				//α値の減算
				m_colorFade.a -= FADE_RATE;

				//α値が0.0fより小さくなったらフェード更新終了
				if (m_colorFade.a <= MIN_ALPHA)
				{
					//最小値に修正
					m_colorFade.a = MIN_ALPHA;
					m_FadeMode = FADE_MODE_NONE;
				}
			}

			//フェードアウト(暗転)処理
			else if (m_FadeMode == FADE_MODE_OUT)
			{
				//α値の加算
				m_colorFade.a += FADE_RATE;

				//α値が1.0fより大きくなったらフェードインへ移行
				if (m_colorFade.a >= MAX_ALPHA)
				{
					//最大値に修正
					m_colorFade.a = MAX_ALPHA;
					m_FadeMode = FADE_MODE_IN;

					//ゲームモードを指定されたものへ移行
					CManager::SetMode(m_modeNext);
				}
			}
			//透明度の設定
			m_pPolygon->SetColor(m_colorFade);
		}
	}
}

//=============================================================================
//フェードクラスの描画処理
//=============================================================================
void CFade::Draw(void)
{
	if (m_pPolygon)
	{
		if (m_FadeMode != FADE_MODE_NONE)
		{
			//ポリゴンクラスの描画処理呼び出し
			m_pPolygon->Draw();
		}
	}
}

//=============================================================================
//フェードクラスの設定処理
//=============================================================================
void CFade::SetFade(CManager::MODE_TYPE mode)
{
	//フェードアウト状態に設定
	m_FadeMode = FADE_MODE_OUT;

	//次のモード情報を保存
	m_modeNext = mode;
}
