//=============================================================================
//
// ランキング処理 [ranking.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _RANKING_H
#define _RANKING_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define RANKING_NUM 5	//ランキング数
#define NUM_LENGTH 8	//桁数

//=============================================================================
//前方宣言
//=============================================================================
class CNumber;

//=============================================================================
//ランキングクラス
//=============================================================================
class CRanking: public CScene
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CRanking();
	~CRanking();

	static CRanking *Create(D3DXVECTOR3 pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f), D3DXVECTOR3 size = D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	HRESULT Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void ReadFile(void);
	void WriteFile(void);
	void SetRanking(int nScore);
	void SetNumber(void);

private:
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	int m_nRank;	//ランクインした際の順位保持変数
	int m_nScore;	//ゲーム終了時点のスコア保持変数
	int m_nRanking[RANKING_NUM];	//ランキング用変数
	CNumber *m_apNumber[RANKING_NUM][NUM_LENGTH];	//ランキング用のポインタ変数
	CNumber *m_apScoreNum[NUM_LENGTH];	//ゲーム終了時点のスコアを表示するためのポインタ変数
	CNumber *m_apRank[RANKING_NUM];	//ランクインした順位を表示するためのポインタ変数
};

#endif 