//=============================================================================
//
// スキル処理 [skill.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _SKILL_H_
#define _SKILL_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SKILL_GAGUE_SIZE_X 4.36f	//スキルのX軸のサイズ
#define SKILL_GAGUE_SIZE_Y 25		//スキルのY軸のサイズ
#define SKILL_GAGUE_SIZE D3DXVECTOR3(SKILL_GAGUE_SIZE_X,SKILL_GAGUE_SIZE_Y,0.0f)	//スキルのサイズ

//=============================================================================
//前方宣言
//=============================================================================
class CGauge;

//=============================================================================
//スキルクラス
//=============================================================================
class CSkill : public CScene
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CSkill(int nPriority = CScene::PRIORITY_UI);
	~CSkill();

	static CSkill*Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);

	HRESULT Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	int GetSkill(void)const;
	void SetSkill(const int nSkill);
	void AddSkill(const int nSkill);

private:
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	CGauge *m_pGauge;	//ゲージクラスのポインタ変数
	int m_nSkillCounter;	//スキルのポイント値
};



#endif 