//=============================================================================
//
// UI処理 [ui.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _UI_H_
#define _UI_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define UNDER_UI_SIZE_X SCREEN_WIDTH	//UIのX軸のサイズ
#define UNDER_UI_SIZE_Y 90.0f			//UIのY軸のサイズ
#define UNDER_UI_SIZE D3DXVECTOR3(SCREEN_WIDTH,UNDER_UI_SIZE_Y,0.0f)	//UIのサイズ

//=============================================================================
//前方宣言
//=============================================================================
class CLife;
class CScore;
class CScene2D;
class CAnimalUi;
class CSkill;

//=============================================================================
//UIクラス
//=============================================================================
class CUi
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CUi();
	~CUi();
	static CUi *Create(void);
	static HRESULT Load(void);
	static void UnLoad(void);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CScore *GetScore(void);
	static CLife *GetLife(void);
	static CSkill *GetSkill(void);
	static CAnimalUi *GetAnimalUI(void);
private:
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	static CScore *m_pScore;	//スコアクラスのポインタ
	static CLife *m_pLife;	//ライフクラスのポインタ変数
	static CSkill *m_pSkill;	//スキルクラスのポインタ変数
	static CAnimalUi *m_pAnimalUI;	//アニマルUIクラスのポインタ変数
	static LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャへのポインタ
	CScene2D *m_pScene2D;	//2Dポリゴンクラスへのポインタ
};
#endif 