//=============================================================================
//
// ホーミング型エネミー処理 [enemyhoming.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _ENEMYHOMING_H
#define _ENEMYHOMING_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "enemy.h"

//=============================================================================
//ホーミング型エネミークラス
//=============================================================================
class CEnemyHoming :public CEnemy
{
public:
	CEnemyHoming();
	~CEnemyHoming();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Attack(void);

private:
};

#endif