//=============================================================================
//
// 狙撃型エネミー処理 [enemysnipng.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "enemysniping.h"
#include "game.h"
#include "player.h"
#include "bullet.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SNIPING_ATK 8 //狙撃型の攻撃力
#define SNIPING_BULLET_SPEED 10.0f //狙撃型の弾の速度

//=============================================================================
//狙撃型エネミークラスのコンストラクタ
//=============================================================================
CEnemySniping::CEnemySniping()
{
}

//=============================================================================
//狙撃型エネミークラスのデストラクタ
//=============================================================================
CEnemySniping::~CEnemySniping()
{
}

//=============================================================================
//狙撃型エネミークラスの初期化処理
//=============================================================================
HRESULT CEnemySniping::Init(void)
{
	CEnemy::Init();
	return S_OK;
}

//=============================================================================
//狙撃型エネミークラスの終了処理
//=============================================================================
void CEnemySniping::Uninit(void)
{
	CEnemy::Uninit();
}

//=============================================================================
//狙撃型エネミークラスの更新処理
//=============================================================================
void CEnemySniping::Update(void)
{
	CEnemy::Update();
}

//=============================================================================
//狙撃型エネミークラスの描画処理
//=============================================================================
void CEnemySniping::Draw(void)
{
	CEnemy::Draw();
}

//=============================================================================
//狙撃型エネミークラスの攻撃処理
//=============================================================================
void CEnemySniping::Attack(void)
{
	//プレイヤーの位置情報を取得
	D3DXVECTOR3 playerPos = CGame::GetPlayer()->GetPos();

	m_nCounter++;

	if (m_nCounter % 80 == 0 && m_pos.x >= playerPos.x)
	{
		//角度θの計算（ラジアン）
		float fAngle = atan2f((playerPos.y - m_pos.y), (playerPos.x - m_pos.x));

		//移動量を求める
		D3DXVECTOR3 move = D3DXVECTOR3(cosf(fAngle) * SNIPING_BULLET_SPEED, sinf(fAngle) * SNIPING_BULLET_SPEED, 0.0f);

		//バレットの生成
		CBullet::Create(m_pos, move, BULLET_SIZE, COLOR_RED,
			CBullet::BULLET_USER_ENEMY, CBullet::BULLET_TYPE_NORMAL, SNIPING_ATK);
	}
}
