//=============================================================================
//
// 狙撃型エネミー処理 [enemysnipng.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _ENEMYSNIPNG_H
#define _ENEMYSNIPNG_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "enemy.h"

//=============================================================================
//狙撃型エネミークラス
//=============================================================================
class CEnemySniping :public CEnemy
{
public:
	CEnemySniping();
	~CEnemySniping();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Attack(void);

private:
};

#endif