//=============================================================================
//
// エネミー処理 [enemynomral.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _ENEMYNOMRAL_H
#define _ENEMYNOMRAL_H

//=============================================================================
//インクルードファイル
//=============================================================================
#include "enemy.h"

//=============================================================================
//ノーマルエネミークラスの
//=============================================================================
class CEnemyNomral :public CEnemy
{
public:
	CEnemyNomral();
	~CEnemyNomral();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Attack(void);

private:
};

#endif