//=============================================================================
//
// レンダラー処理 [renderer.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _RENDERER_H_
#define _RENDERER_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//レンダリングクラス
//=============================================================================
class CRenderer
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CRenderer();
	~CRenderer();
	HRESULT Init(HWND hWnd, bool bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	LPDIRECT3DDEVICE9 GetDevice(void);

#ifdef _DEBUG
	void DrawFPS(void);
#endif
private:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	LPDIRECT3DDEVICE9 m_pD3DDevice;	// Deviceオブジェクトのデバイス情報(描画に必要)
	LPDIRECT3D9	m_pD3D;			// Direct3Dオブジェクト
	
#ifdef _DEBUG
	LPD3DXFONT	m_pFont = NULL;			// フォントへのポインタ
#endif
};
#endif